**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
module.vault.tls_private_key.ca: Refreshing state... [id=676297fd67b11f6aa7bd86e58438b45b0e80c9b2]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
data.github_user.georgewitteman: Reading...
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
module.vault.tls_private_key.server: Refreshing state... [id=db568906a93847b9b30cde7e6c6e7c5052beaef5]
data.github_repository.terraform: Reading...
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
data.tls_certificate.github: Reading...
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701467]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=37701472]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701458]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701466]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701456]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701461]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
data.github_repository.terraform: Read complete after 0s [id=terraform]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701465]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
data.github_user.georgewitteman: Read complete after 0s [id=5918935]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701459]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701476]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=37701464]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=37701462]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
dnsimple_zone_record.google_workspace_verification: Refreshing state... [id=37701471]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701468]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=37701457]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=37701474]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=37701460]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=37701473]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=37701475]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701470]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=37701469]
module.vault.tls_self_signed_cert.ca: Refreshing state... [id=4565781077164491759303888761625348596]
module.tailscale_relay.data.aws_ami.this: Reading...
aws_route53_zone.marcywitteman_com: Refreshing state... [id=Z0939016Z0WL8RV5A0D1]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
aws_key_pair.georgewitteman: Refreshing state... [id=georgewitteman-personal]
aws_route53_zone.georgewitteman_com: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN]
aws_eip.nat[2]: Refreshing state... [id=eipalloc-0fe0796fc3f2b92d0]
module.vault.data.aws_region.current: Reading...
module.tailscale_relay.data.aws_region.current: Reading...
module.vault.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.tailscale_relay.data.aws_iam_policy_document.session_manager: Reading...
module.tailscale_relay.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.tailscale_relay.data.aws_iam_policy_document.session_manager: Read complete after 0s [id=414293167]
module.vault.data.aws_iam_policy_document.cloud_auto_join: Reading...
module.vault.data.aws_iam_policy_document.cloud_auto_join: Read complete after 0s [id=638072103]
module.vault.data.aws_iam_policy_document.instance_role: Reading...
module.vault.data.aws_ami.ubuntu: Reading...
module.vault.data.aws_iam_policy_document.instance_role: Read complete after 0s [id=1903849331]
aws_vpc.this: Refreshing state... [id=vpc-0531d36726bdd6529]
aws_route53_zone.wtmn_net: Refreshing state... [id=Z093069418CSBZIY3FKFL]
module.vault.aws_kms_key.this: Refreshing state... [id=d7d4acc9-57de-4f84-8583-9b6fedef0e0f]
module.tailscale_relay.data.aws_iam_policy_document.instance_role: Reading...
module.tailscale_relay.data.aws_iam_policy_document.instance_role: Read complete after 0s [id=1903849331]
aws_route53_zone.georgewitteman_me: Refreshing state... [id=Z0431101102WXYNRXVF0T]
module.tailscale_relay.data.aws_ami.this: Read complete after 1s [id=ami-026b57f3c383c2eec]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_route53_zone.witteman_test_com: Refreshing state... [id=Z00288031C5HWCGKS61C1]
module.vault.data.aws_ami.ubuntu: Read complete after 1s [id=ami-096e0c14792ec93ac]
module.vault.data.aws_iam_policy_document.session_manager: Reading...
module.vault.data.aws_iam_policy_document.session_manager: Read complete after 0s [id=414293167]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_route53_zone.witteman_me: Refreshing state... [id=Z05063061CYA524JAU8BC]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f95edc7d600a0f11]
aws_eip.nat[1]: Refreshing state... [id=eipalloc-0eab7a9978907b615]
module.vault.aws_iam_role.instance_role: Refreshing state... [id=main-vault20221011203448912900000001]
data.aws_iam_policy_document.github_oidc: Reading...
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
module.vault.aws_secretsmanager_secret.tls: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:866631827662:secret:main-tls-secret-jBySJQ]
module.vault.data.aws_iam_policy_document.auto_unseal: Reading...
module.vault.data.aws_iam_policy_document.auto_unseal: Read complete after 0s [id=820717070]
aws_route53_record.wtmn_net_txt: Refreshing state... [id=Z093069418CSBZIY3FKFL__TXT]
aws_route53_record.georgewitteman_me_txt: Refreshing state... [id=Z0431101102WXYNRXVF0T__TXT]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_www_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3s._tcp_SRV]
module.aws_squarespace_marcywitteman_com.aws_route53_record.a: Refreshing state... [id=Z0939016Z0WL8RV5A0D1__A]
module.aws_fastmail_wtmn_net.aws_route53_record.mx: Refreshing state... [id=Z093069418CSBZIY3FKFL__MX]
module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0]: Refreshing state... [id=Z093069418CSBZIY3FKFL__dmarc_TXT]
module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_ygcg8lysbebsftxsez6l_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps: Refreshing state... [id=Z093069418CSBZIY3FKFL__imaps._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap: Refreshing state... [id=Z093069418CSBZIY3FKFL__jmap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission: Refreshing state... [id=Z093069418CSBZIY3FKFL__submission._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap: Refreshing state... [id=Z093069418CSBZIY3FKFL__imap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldavs._tcp_SRV]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_wtmn_net.aws_route53_record.mail: Refreshing state... [id=Z093069418CSBZIY3FKFL_mail_A]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3._tcp_SRV]
aws_route53_record.georgewitteman_com_txt: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__TXT]
aws_route53domains_registered_domain.witteman_test_com: Refreshing state... [id=witteman-test.com]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mail: Refreshing state... [id=Z0431101102WXYNRXVF0T_mail_A]
aws_acm_certificate.vault: Refreshing state... [id=arn:aws:acm:us-east-1:866631827662:certificate/d8d145fb-b653-4f8e-9c8f-2fbaa6539426]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z0431101102WXYNRXVF0T__dmarc_TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z0431101102WXYNRXVF0T__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z0431101102WXYNRXVF0T__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z0431101102WXYNRXVF0T__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z0431101102WXYNRXVF0T__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3._tcp_SRV]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Read complete after 0s [id=Z093069418CSBZIY3FKFL]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mx: Refreshing state... [id=Z0431101102WXYNRXVF0T__MX]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldav._tcp_SRV]
aws_route53_record.witteman_me_txt: Refreshing state... [id=Z05063061CYA524JAU8BC__TXT]
module.vault.data.aws_iam_policy_document.secrets_manager: Reading...
module.vault.data.aws_iam_policy_document.secrets_manager: Read complete after 0s [id=3024641784]
aws_subnet.private[0]: Refreshing state... [id=subnet-051e9de45c87a959d]
aws_subnet.private[1]: Refreshing state... [id=subnet-083e37d65579ec479]
aws_subnet.private[2]: Refreshing state... [id=subnet-0e1c4b8ec59fbdd04]
aws_subnet.public[0]: Refreshing state... [id=subnet-00d39134e9b5fa53b]
aws_subnet.public[1]: Refreshing state... [id=subnet-00ae48e4b817339e0]
aws_subnet.public[2]: Refreshing state... [id=subnet-0c1df0f1c09145af5]
aws_route_table.public: Refreshing state... [id=rtb-0d091192150dea7f5]
aws_internet_gateway.this: Refreshing state... [id=igw-03e5d4bd084f0bab7]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z0431101102WXYNRXVF0T]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mail: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_mail_A]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_com.aws_route53_record.mx: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__MX]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imaps._tcp_SRV]
module.vault.aws_iam_role_policy.auto_unseal: Refreshing state... [id=main-vault20221011203448912900000001:main-vault-auto-unseal]
module.vault.aws_iam_role_policy.session_manager: Refreshing state... [id=main-vault20221011203448912900000001:main-vault-ssm]
module.vault.aws_iam_role_policy.cloud_auto_join: Refreshing state... [id=main-vault20221011203448912900000001:main-vault-auto-join]
module.vault.aws_iam_instance_profile.vault: Refreshing state... [id=main-vault20221011203450069200000003]
module.vault.tls_cert_request.server: Refreshing state... [id=20442d7d666823588afc2f5060972881c76a11e0]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm2._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm1._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm3._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z05063061CYA524JAU8BC__carddavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z05063061CYA524JAU8BC__caldav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z05063061CYA524JAU8BC__carddav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z05063061CYA524JAU8BC__dmarc_TXT]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z05063061CYA524JAU8BC__imap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mx: Refreshing state... [id=Z05063061CYA524JAU8BC__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z05063061CYA524JAU8BC__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mail: Refreshing state... [id=Z05063061CYA524JAU8BC_mail_A]
module.aws_fastmail_witteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z05063061CYA524JAU8BC__submission._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z05063061CYA524JAU8BC__jmap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z05063061CYA524JAU8BC__caldavs._tcp_SRV]
module.vault.aws_iam_role_policy.secrets_manager: Refreshing state... [id=main-vault20221011203448912900000001:main-vault-secrets-manager]
module.vault.aws_lb_target_group.vault: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:866631827662:targetgroup/main-vault-tg/2bfbbad389c96edd]
module.tailscale_relay.data.aws_vpc.selected: Reading...
module.vault.aws_security_group.vault: Refreshing state... [id=sg-0b5a748a5ad47e589]
module.vault.data.aws_vpc.selected: Reading...
module.vault.aws_security_group.vault_lb: Refreshing state... [id=sg-0de9370bcef743b66]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-00188ac2302e5798f]
aws_nat_gateway.this[1]: Refreshing state... [id=nat-002a849bc68072cbc]
aws_nat_gateway.this[2]: Refreshing state... [id=nat-071542ca0f78f431b]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Read complete after 2s [id=Z04997513SHTSY0FZ1ZPN]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-050a400e2080b4c11]
module.tailscale_relay.data.aws_vpc.selected: Read complete after 0s [id=vpc-0531d36726bdd6529]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f61e31cf053bde0]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c7df13522aa1d8e7]
aws_route53_record.acm_vault["vault.witteman-test.com"]: Refreshing state... [id=Z00288031C5HWCGKS61C1__baf9205212cd5b3f32ba5dbf72a5ab6b.vault.witteman-test.com._CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm1._domainkey_CNAME]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Read complete after 0s [id=Z05063061CYA524JAU8BC]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm2._domainkey_CNAME]
module.vault.data.aws_vpc.selected: Read complete after 0s [id=vpc-0531d36726bdd6529]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm3._domainkey_CNAME]
aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0d091192150dea7f51080289494]
module.vault.tls_locally_signed_cert.server: Refreshing state... [id=320977435779730706840585672013292257003]
module.vault.aws_lb.vault_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:866631827662:loadbalancer/app/main-vault-lb/7b3a1350e0d4da70]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm3._domainkey_CNAME]
module.vault.aws_security_group_rule.vault_outbound: Refreshing state... [id=sgrule-176368161]
module.vault.aws_security_group_rule.vault_application_lb_inbound: Refreshing state... [id=sgrule-4287834096]
module.vault.aws_launch_template.vault: Refreshing state... [id=lt-02896cc739ca81987]
module.vault.aws_security_group_rule.vault_internal_raft: Refreshing state... [id=sgrule-356744988]
module.vault.aws_security_group_rule.vault_lb_outbound: Refreshing state... [id=sgrule-2899265345]
module.vault.aws_security_group_rule.vault_internal_api: Refreshing state... [id=sgrule-1747204904]
aws_route_table.private[1]: Refreshing state... [id=rtb-0421fc362d0be267c]
aws_route_table.private[2]: Refreshing state... [id=rtb-00003095986e009a5]
aws_route_table.private[0]: Refreshing state... [id=rtb-09d9f2dcbbb27c73c]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm1._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm2._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm3._domainkey_CNAME]
module.vault.aws_security_group_rule.vault_ssh_inbound: Refreshing state... [id=sgrule-926160801]
module.vault.aws_security_group_rule.vault_lb_inbound: Refreshing state... [id=sgrule-2885890245]
aws_acm_certificate_validation.vault: Refreshing state... [id=2022-10-11 20:35:17.714 +0000 UTC]
module.vault.aws_lb_listener.vault: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:866631827662:listener/app/main-vault-lb/7b3a1350e0d4da70/188e03fbac8344ca]
module.vault.aws_autoscaling_group.vault: Refreshing state... [id=main-vault]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-069aefed8b305b68b]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0b0d06a5d7575b26f]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-086178e831a055e81]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09d9f2dcbbb27c73c1080289494]
aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0421fc362d0be267c1080289494]
aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-00003095986e009a51080289494]
aws_route53_record.vault: Refreshing state... [id=Z00288031C5HWCGKS61C1_vault_CNAME]
module.vault.aws_secretsmanager_secret_version.tls: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:866631827662:secret:main-tls-secret-jBySJQ|A31E4A01-83C7-4358-9BF8-B28BFEB9DBAC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # tailscale_tailnet_key.aws_relay will be created
  + resource "tailscale_tailnet_key" "aws_relay" {
      + ephemeral     = true
      + id            = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
    }

  # module.tailscale_relay.data.aws_iam_policy_document.secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "secrets_manager" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.tailscale_relay.aws_autoscaling_group.this will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "main-tailscale-relay"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-00ae48e4b817339e0",
          + "subnet-00d39134e9b5fa53b",
          + "subnet-0c1df0f1c09145af5",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "main-tailscale-relay"
        }
      + tag {
          + key                 = "main-tailscale"
          + propagate_at_launch = true
          + value               = "server"
        }
    }

  # module.tailscale_relay.aws_iam_instance_profile.tailscale will be created
  + resource "aws_iam_instance_profile" "tailscale" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "main-tailscale"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.tailscale_relay.aws_iam_role.instance_role will be created
  + resource "aws_iam_role" "instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "main-tailscale"
      + path                  = "/"
      + tags_all              = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.tailscale_relay.aws_iam_role_policy.secrets_manager will be created
  + resource "aws_iam_role_policy" "secrets_manager" {
      + id     = (known after apply)
      + name   = "main-tailscale-secrets-manager"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.tailscale_relay.aws_iam_role_policy.session_manager will be created
  + resource "aws_iam_role_policy" "session_manager" {
      + id     = (known after apply)
      + name   = "main-tailscale-ssm"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                          + "ssm:UpdateInstanceInformation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.tailscale_relay.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "AWS KMS Customer-managed key used for Vault auto-unseal and encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

  # module.tailscale_relay.aws_launch_template.this will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-026b57f3c383c2eec"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = "main-tailscale-relay"
      + name_prefix            = (known after apply)
      + tags_all               = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 20
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
        }
    }

  # module.tailscale_relay.aws_secretsmanager_secret.authkey will be created
  + resource "aws_secretsmanager_secret" "authkey" {
      + arn                            = (known after apply)
      + description                    = "Tailscale pre-authorization key for the tailscale relay"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "main-tailscale-relay-authkey"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.tailscale_relay.aws_secretsmanager_secret_version.authkey will be created
  + resource "aws_secretsmanager_secret_version" "authkey" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.tailscale_relay.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for the subnet router"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-tailscale"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0531d36726bdd6529"
    }

  # module.tailscale_relay.aws_security_group_rule.outbound will be created
  + resource "aws_security_group_rule" "outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow Tailscale relay to send outbound traffic anywhere"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*